window.nepalData = {
    MINISTRIES: [
        "प्रधानमन्त्री तथा मन्त्रिपरिषद्को कार्यालय", "अर्थ मन्त्रालय", "उद्योग, वाणिज्य तथा आपूर्ति मन्त्रालय",
        "ऊर्जा, जलस्रोत तथा सिंचाइ मन्त्रालय", "कानून, न्याय तथा संसदीय मामिला मन्त्रालय", "कृषि, वन तथा पर्यावरण मन्त्रालय",
        "गृह मन्त्रालय", "परराष्ट्र मन्त्रालय", "पूर्वाधार विकास मन्त्रालय",
        "भूमि व्यवस्था, सहकारी, सङ्घीय मामिला तथा सामान्य प्रशासन मन्त्रालय",
        "महिला, बालबालिका, लैङ्गिक तथा यौनिक अल्पसङ्ख्यक र सामाजिक सुरक्षा मन्त्रालय", "युवा, श्रम तथा रोजगार मन्त्रालय",
        "रक्षा मन्त्रालय", "विज्ञान प्रविधि तथा नवप्रवर्तन मन्त्रालय", "शिक्षा तथा खेलकुद मन्त्रालय", "सूचना तथा सञ्चार मन्त्रालय",
        "संस्कृति, पर्यटन तथा नागरिक उड्डयन मन्त्रालय", "स्वास्थ्य तथा खाद्य स्वच्छता मन्त्रालय", "संवैधानिक अङ्ग", "कोशी प्रदेश", "मधेश प्रदेश", "बागमती प्रदेश", "गण्डकी प्रदेश", "लुम्बिनी प्रदेश", "कर्णाली प्रदेश", "सुदूर पश्चिम प्रदेश"
    ],
    PROVINCE: {
        1: 'कोशी प्रदेश', 2: 'मधेश प्रदेश', 3: 'बागमती प्रदेश', 4: 'गण्डकी प्रदेश',
        5: 'लुम्बिनी प्रदेश', 6: 'कर्णाली प्रदेश', 7: 'सुदूर पश्चिम प्रदेश'
    },
    DISTRICTS: {
        1: ['ताप्लेजुङ', 'पाँचथर', 'इलाम', 'झापा', 'मोरङ', 'सुनसरी', 'धनकुटा', 'तेह्रथुम', 'संखुवासभा', 'भोजपुर', 'सोलुखुम्बु', 'ओखलढुङ्गा', 'खोटाङ', 'उदयपुर'],
        2: ['सप्तरी', 'सिराहा', 'धनुषा', 'महोत्तरी', 'सर्लाही', 'रौतहट', 'बारा', 'पर्सा'],
        3: ['सिन्धुली', 'रामेछाप', 'दोलखा', 'सिन्धुपाल्चोक', 'काभ्रेपलाञ्चोक', 'ललितपुर', 'भक्तपुर', 'काठमाडौं', 'नुवाकोट', 'रसुवा', 'धादिङ', 'चितवन', 'मकवानपुर'],
        4: ['गोरखा', 'लमजुङ', 'तनहुँ', 'कास्की', 'मनाङ', 'मुस्ताङ', 'पर्वत', 'स्याङ्जा', 'म्याग्दी', 'बाग्लुङ', 'नवलपरासी (बर्दघाट सुस्ता पूर्व)'],
        5: ['नवलपरासी (बर्दघाट सुस्ता पश्चिम)', 'रुपन्देही', 'कपिलवस्तु', 'पाल्पा', 'अर्घाखाँची', 'गुल्मी', 'रोल्पा', 'प्युठान', 'दाङ', 'बाँके', 'बर्दिया', 'पूर्वी रुकुम'],
        6: ['पश्चिम रुकुम', 'सल्यान', 'सुर्खेत', 'दैलेख', 'जाजरकोट', 'डोल्पा', 'हुम्ला', 'जुम्ला', 'कालिकोट', 'मुगु'],
        7: ['बाजुरा', 'बझाङ', 'डोटी', 'अछाम', 'दार्चुला', 'बैतडी', 'डडेल्धुरा', 'कञ्चनपुर', 'कैलाली']
    },
    MUNICIPALITIES: {
        1: {
            "ताप्लेजुङ": ["फुङलिङ", "आठराई त्रिवेणी", "फक्ताङलुङ", "मिक्वाखोला", "मेरिङदेन", "मैवाखोला", "पाथिभरा याङ्वरक", "सिदिङ्वा", "सिरीजङ्घा"],
            "भोजपुर": ["आमचोक", "अरुण", "भोजपुर", "हतुवागढी", "पौवादुङ्मा", "रामप्रसाद राई", "साल्पासिलिछो", "षडानन्द", "टेम्केमैयुङ"],
            "धनकुटा": ["चौबिसे", "छथर जोरपाटी", "धनकुटा", "महालक्ष्मी", "पाख्रिबास", "साँगुरीगढी", "शहिदभूमि"],
            "इलाम": ["चुलाचुली", "देउमाई", "फाकफोक्थुम", "इलाम", "माई", "माइजोगमाई", "मङसेबुङ", "रोङ", "सन्दकपुर", "सूर्योदय"],
            "झापा": ["अर्जुनधारा", "बाह्रदशी", "भद्रपुर", "बिर्तामोड", "बुद्धशान्ति", "दमक", "गौरादह", "गौरीगञ्ज", "हल्दिबारी", "झापा", "कचनकवल", "कमल", "कन्काई", "मेचीनगर", "शिवसताक्षी"],
            "खोटाङ": ["ऐसेलुखर्क", "बराहपोखरी", "दिक्तेल रुपाकोट मझुवागढी", "दिप्रुङ चुइचुम्मा", "हलेसी तुवाचुङ", "जन्तेढुङ्गा", "केपिलासगढी", "खोटेहाङ", "रावा बेसी", "साकेला"],
            "मोरङ": ["बेलबारी", "विराटनगर", "बुढीगंगा", "धनपालथान", "ग्रामथान", "जहदा", "कानेपोखरी", "कटहरी", "केराबारी", "लेटाङ", "मिक्लाजुङ", "पथरी शनिश्चरे", "रंगेली", "रतुवामाई", "सुन्दरहरैचा", "सुनवर्शी", "उर्लाबारी"],
            "ओखलढुङ्गा": ["चम्पादेवी", "चिसंखुगढी", "खिजिदेम्बा", "लिखु", "मानेभञ्ज्याङ", "मोलुङ", "सिद्धिचरण", "सुनकोशी"],
            "पाँचथर": ["फालेलुङ", "फाल्गुनन्द", "हिलिहाङ", "कुम्मायक", "मिक्लाजुङ", "फिदिम", "तुम्बेवा", "याङवरक"],
            "संखुवासभा": ["भोटखोला", "चैनपुर", "चिचिला", "धर्मदेवी", "खाँदबारी", "मादी", "मकालु", "पाँचखपन", "सभापोखरी", "सिलिचोङ"],
            "सोलुखुम्बु": ["खुम्बु पासाङल्हामु", "लिखु पिके", "माप्य दुधकोशी", "महाकुलुङ", "नेचासल्यान", "सोलुदुधकुण्ड", "सोताङ", "थुलुङ दुधकोशी"],
            "तेह्रथुम": ["आठराई", "छथर", "लालीगुराँस", "मेन्छयायेम", "म्याङलुङ", "फेदाप"],
            "सुनसरी": ["बराहक्षेत्र", "बर्जु", "भोक्राहा नरसिंह", "देवानगन्ज", "धरान", "दुहबी", "गढी", "हरिनगर", "इनरुवा", "इटहरी", "कोशी", "रामधुनी"],
            "उदयपुर": ["बेलका", "चौदण्डीगढी", "कटारी", "लिम्चुङबुङ", "रौतामाई", "ताप्ली", "त्रियुगा", "उदयपुरगढी"]
        },
        2: {
            "सप्तरी": ["अग्निसाइर कृष्णसवरन", "बलान बिहुल", "विष्णुपुर", "बोदेबरसाइन", "छिन्नमस्ता", "डाक्नेश्वरी", "हनुमाननगर कंकालिनी", "कञ्चनरुप", "खडक", "महादेवा", "राजविराज", "राजगढ", "रुपनी", "सप्तकोशी", "शम्भुनाथ", "सुरुङ्गा", "तिलाठी कोइलाडी", "तिरहुत"],
            "सिराहा": ["अर्नमा", "औरही", "बरियारपट्टी", "भगवानपुर", "विष्णुपुर", "धनगढीमाई", "गोलबजार", "कल्याणपुर", "कर्जन्हा", "लहान", "लक्ष्मीपुर पतारी", "मिर्चैया", "नरहा", "नवराजपुर", "सखुवान्कारकट्टी", "सिरहा", "सुखीपुर"],
            "धनुषा": ["औरही", "बटेश्वर", "बिदेह", "क्षिरेश्वरनाथ", "धनौजी", "धनुषाधाम", "गणेशमान चारनाथ", "हंसपुर", "जनकनन्दनी", "जनकपुरधाम", "कमला", "लक्ष्मीनिया", "मिथिला", "मिथिला बिहारी", "मुखियापट्टी मुसहरमिया", "नगराइन", "सबैला", "शहिदनगर"],
            "महोत्तरी": ["औरही", "बलवा", "बर्दिवास", "भङ्गाहा", "एकडारा", "गौशाला", "जलेश्वर", "लोहारपट्टी", "महोत्तरी", "मनरा सिसवा", "मटिहानी", "पिपरा", "रामगोपालपुर", "साम्सी", "सोनमा"],
            "सर्लाही": ["बागमती", "बलरा", "बराहथवा", "बासबरिया", "विष्णु", "ब्रम्हपुरी", "चक्रघट्टा", "चन्द्रनगर", "धनकौल", "गोडैटा", "हरिपुर", "हरिपुर्वा", "हरिवन", "ईश्वरपुर", "कबिलासी", "कौडेना", "लालबन्दी", "मलङ्गवा", "पर्सा", "रामनगर"],
            "बारा": ["आदर्श कोतवाल", "बारागढी", "बिश्रामपुर", "देवताल", "जितपुर-सिमरा", "कलैया", "करैयामाई", "कोल्हवी", "महागढीमाई", "निजगढ", "पचरौता", "परवानीपुर", "फेटा", "प्रसौनी", "सिम्रौनगढ", "सुवर्ण"],
            "पर्सा": ["बहुदरमाई", "बिन्दवासिनी", "वीरगन्ज", "छिपहरमाई", "धोबिनी", "जगरनाथपुर", "जिराभवानी", "कालिकामाई", "पकाहा मैनपुर", "पर्सागढी", "पटेर्वा सुगौली", "पोखरिया", "सखुवा प्रसौनी", "ठोरी"],
            "रौतहट": ["बौधिमाई", "वृन्दाबन", "चन्द्रपुर", "देवाही गोनाही", "दुर्गा भगवती", "गढीमाई", "गरुडा", "गौर", "गुजरा", "ईशनाथ", "कटहरिया", "माधव नारायण", "मौलापुर", "परोहा", "फतुवा विजयपुर", "राजदेवी", "राजपुर", "यमुनामाई"]
        },
        3: {
            "भक्तपुर": ["भक्तपुर", "चाँगुनारायण", "मध्यपुरथिमि", "सूर्यविनायक"],
            "चितवन": ["भरतपुर", "इच्छाकामना", "कालिका", "खैरहनी", "माडी", "राप्ती", "रत्ननगर"],
            "धादिङ": ["बेनिघाट रोराङ", "धुनिबेसी", "गजुरी", "गल्छी", "गंगाजमुना", "ज्वालामुखी", "खनियाबास", "नेत्रावती डब्जोङ", "नीलकण्ठ", "रुबी भ्याली", "सिद्धलेक", "थाक्रे", "त्रिपुरा सुन्दरी"],
            "दोलखा": ["बैतेश्वर", "भीमेश्वर", "बिगु", "गौरीशंकर", "जिरी", "कालिञ्चोक", "मेलुङ", "सैलुङ", "तामाकोशी"],
            "काठमाडौं": ["बुढानिलकण्ठ", "चन्द्रागिरि", "दक्षिणकाली", "गोकर्णेश्वर", "कागेश्वरी मनोहरा", "काठमाडौं", "कीर्तिपुर", "नागार्जुन", "शंखरापुर", "तारकेश्वर", "टोखा"],
            "काभ्रेपलाञ्चोक": ["बनेपा", "बेथानचोक", "भुम्लु", "चौरीदेउराली", "धुलिखेल", "खानीखोला", "महाभारत", "मण्डनदेउपुर", "नमोबुद्ध", "पनौती", "पाँचखाल", "रोशी", "तेमाल"],
            "ललितपुर": ["बागमती", "गोदावरी", "कोन्ज्योसोम", "ललितपुर", "महालक्ष्मी", "महांकाल"],
            "मकवानपुर": ["बागमती", "बकैया", "भीमफेदी", "हेटौंडा", "इन्द्रसरोवर", "कैलाश", "मकवानपुरगढी", "मनहरी", "राक्सिराङ", "थाहा"],
            "नुवाकोट": ["बेलकोटगढी", "बिदुर", "दुप्चेश्वर", "ककनी", "किस्पाङ", "लिखु", "म्यागाङ", "पञ्चकन्या", "शिवपुरी", "सुर्यगढी", "ताडी", "तारकेश्वर"],
            "रामेछाप": ["दोरम्बा", "गोकुलगंगा", "खाडादेवी", "लिखु तामाकोशी", "मन्थली", "रामेछाप", "सुनापति", "उमाकुण्ड"],
            "रसुवा": ["आमाछोदिङमो", "गोसाइकुण्ड", "कालिका", "नौकुण्ड", "उत्तरगया"],
            "सिन्धुली": ["दुधौली", "घाङ्लेख", "गोलन्जोर", "हरिहरपुरगढी", "कमलामाई", "मारिन", "फिक्कल", "सुनकोशी", "तिनपाटन"],
            "सिन्धुपाल्चोक": ["बलेफी", "बाह्रबिसे", "भोटेकोशी", "चौतारा साँगाचोकगढी", "हेलम्बु", "इन्द्रावती", "जुगल", "लिसाङ्खु", "मेलम्ची", "पाँचपोखरी थाङ्पाल", "सुनकोशी", "त्रिपुरासुन्दरी"]
        },
        4: {
            "बाग्लुङ": ["बडिगाड", "बाग्लुङ", "बरेङ", "ढोरपाटन", "गलकोट", "जैमिनी", "काँठेखोला", "निसिखोला", "तमान खोला", "तारा खोला"],
            "गोरखा": ["आरुघाट", "अजिरकोट", "बारपाक सुलिकोट", "भीमसेनथापा", "चुम नुब्रि", "धार्चे", "गण्डकी", "गोरखा", "पालुङटार", "सहिद लखन", "सिरानचोक"],
            "कास्की": ["अन्नपूर्ण", "माछापुच्छ्रे", "माडी", "पोखरा लेखनाथ", "रुपा"],
            "लमजुङ": ["बेंसीशहर", "दोर्दी", "दूधपोखरी", "क्वालासोथर", "मध्यनेपाल", "मर्स्याङ्दी", "राइनास", "सुन्दरबजार"],
            "मनाङ": ["चामे", "मनाङ ङिस्याङ", "नार्पा भूमि", "नाँशो"],
            "मुस्ताङ": ["घरापझोङ", "लो घेकर दामोदरकुण्ड", "लोमान्थाङ", "थासाङ", "वारागुङ मुक्तिक्षेत्र"],
            "म्याग्दी": ["अन्नपूर्ण", "बेनी", "धौलागिरी", "मालिका", "मंगला", "रघुगंगा"],
            "नवलपरासी (बर्दघाट सुस्ता पूर्व)": ["बौदिकाली", "बिनयी", "बुलिङटार", "देवचुली", "गैंडाकोट", "हुप्सेकोट", "कावासोती", "मध्यविन्दु"],
            "पर्वत": ["बिहादी", "जलजला", "कुश्मा", "महाशिला", "मोदी", "पैयुँ", "फलेबास"],
            "स्याङ्जा": ["आँधीखोला", "अर्जुनचौपरी", "भिरकोट", "बिरुवा", "चापाकोट", "गल्याङ", "हरिनास", "कालीगण्डकी", "फेंदीखोला", "पुतलीबजार", "वालिङ"],
            "तनहुँ": ["आँबुखैरेनी", "बन्दीपुर", "भानु", "भीमाद", "ब्यास", "देवघाट", "घिरिङ", "म्याग्दे", "रिसिङ", "शुक्लागण्डकी"]
        },
        5: {
            "अर्घाखाँची": ["भूमिकास्थान", "छत्रदेव", "मालारानी", "पाणिनी", "सन्धिखर्क", "सितगंगा"],
            "बाँके": ["बैजनाथ", "डुडुवा", "जानकी", "खजुरा", "कोहलपुर", "नरैनापुर", "नेपालगन्ज", "राप्ती सोनारी"],
            "बर्दिया": ["बढैयाताल", "बाँसगढी", "बारबर्दिया", "गेरुवा", "गुलरिया", "मधुवन", "राजापुर", "ठाकुरबाबा"],
            "दाङ": ["बबई", "बंगलाचुली", "दंगिशरण", "गढवा", "घोराही", "लमही", "राजपुर", "राप्ती", "शान्तिनगर", "तुलसीपुर"],
            "गुल्मी": ["चन्द्रकोट", "छत्रकोट", "गुल्मीदरबार", "इस्मा", "कालीगण्डकी", "मदाने", "मालिका", "मुसिकोट", "रेसुंगा", "रुरु", "सत्यवती"],
            "कपिलवस्तु": ["बाणगंगा", "विजयनगर", "बुद्धभूमि", "कपिलवस्तु", "कृष्णनगर", "महाराजगन्ज", "मायादेवी", "शिवराज", "शुद्धोधन", "यशोधरा"],
            "नवलपरासी (बर्दघाट सुस्ता पश्चिम)": ["बर्दघाट", "पाल्ही नन्दन", "प्रतापपुर", "रामग्राम", "सरवल", "सुनवल", "सुस्ता"],
            "पाल्पा": ["बागनासकाली", "माथागढी", "निस्दी", "पूर्वखोला", "रैनादेवी", "रम्भा", "रामपुर", "रिब्दीकोट", "तानसेन", "तिनाउ"],
            "प्युठान": ["ऐरावत", "गौमुखी", "झिमरुक", "मल्लरानी", "माण्डवी", "नौबहिनी", "प्युठान", "सरूमारानी", "स्वर्गद्वारी"],
            "रोल्पा": ["गंगादेव", "लुङ्गरी", "माडी", "परिवर्तन", "रोल्पा", "रुन्टीगढी", "सुनछहरी", "सुनिल स्मृति", "थवाङ", "त्रिवेणी"],
            "रुकुम पूर्व": ["भुमे", "पुथा उत्तरगंगा", "सिस्ने"],
            "पूर्वी रुकुम": ["भुमे", "पुथा उत्तरगंगा", "सिस्ने"],
            "रुकुम (पूर्व)": ["भुमे", "पुथा उत्तरगंगा", "सिस्ने"],
            "रुपन्देही": ["बुटवल", "देवदह", "गैडहवा", "कञ्चन", "कोटाहिमाई", "लुम्बिनी सांस्कृतिक", "मार्चवारी", "मायादेवी", "ओमसतिया", "रोहिणी", "सैनामैना", "समरीमाइ", "सिद्धार्थनगर", "सियारी", "शुद्धोधन", "तिलोत्तमा"]
        },
        6: {
            "दैलेख": ["आठबीस", "भगवतीमाई", "भैरवी", "चामुण्डा बिन्द्रासैनी", "दुल्लु", "डुङ्गेश्वर", "गुराँस", "महाबु", "नारायण", "नौमुले", "ठाँटीकाँध"],
            "डोल्पा": ["छार्का ताङसोङ", "डोल्पो बुद्ध", "जगदुल्ला", "काइके", "मुड्केचुला", "शे फोक्सुण्डो", "ठूलीभेरी", "त्रिपुरासुन्दरी"],
            "हुम्ला": ["अदानचुली", "चंखेली", "खार्पुनाथ", "नाम्खा", "सार्केगाड", "सिमकोट", "ताँजाकोट"],
            "जाजरकोट": ["बारेकोट", "भेरी", "छेडागाड", "जुनिचाँदे", "कुसे", "नलगाड", "शिवालय"],
            "जुम्ला": ["चन्दननाथ", "गुठीचौर", "हिमा", "कनकसुन्दरी", "पत्रासी", "सिन्जा", "तातोपानी", "तिला"],
            "कालिकोट": ["खाँडाचक्र", "महावै", "नरहरिनाथ", "पचालझरना", "पलाता", "रास्कोट", "सान्नी त्रिवेणी", "शुभ कालिका", "तिलागुफा"],
            "मुगु": ["छायानाथ रारा", "खत्याड", "मुगुम कर्मारोङ", "सोरु"],
            "पश्चिम रुकुम": ["आठबिसकोट", "बाँफिकोट", "चौरजहारी", "मुसिकोट", "सानी भेरी", "त्रिवेणी"],
            "रुकुम पश्चिम": ["आठबिसकोट", "बाँफिकोट", "चौरजहारी", "मुसिकोट", "सानी भेरी", "त्रिवेणी"],
            "रुकुम (पश्चिम)": ["आठबिसकोट", "बाँफिकोट", "चौरजहारी", "मुसिकोट", "सानी भेरी", "त्रिवेणी"],
            "सल्यान": ["बागचौर", "बनगाड कुपिण्डे", "छत्रेश्वरी", "दार्मा", "कालीमाटी", "कपुरकोट", "कुमाख", "शारदा", "सिद्ध कुमाख", "त्रिवेणी"],
            "सुर्खेत": ["बराहताल", "भेरीगंगा", "वीरेन्द्रनगर", "चौकुने", "चिंगाड", "गुर्भाकोट", "लेकबेशी", "पञ्चपुरी", "सिम्ता"]
        },
        7: {
            "अछाम": ["बान्नीगढी जयगढ", "चौरपाटी", "ढकारी", "कमलबजार", "मंगलसेन", "मेल्लेख", "पञ्चदेवल विनायक", "रामारोशन", "साँफेबगर", "तुर्माखाँद"],
            "बैतडी": ["दशरथचन्द", "डिलासैनी", "दोगडाकेदार", "मेलौली", "पञ्चेश्वर", "पाटन", "पुर्चौडी", "शिवनाथ", "सिगास", "सुर्नया"],
            "बझाङ": ["बित्थडचिर", "बुंगल", "छबिसपाथीभेरा", "दुर्गाथली", "जय पृथ्वी", "केदारस्युँ", "खप्तडछान्ना", "मस्टा", "साइपाल", "सुर्मा", "तलकोट", "थलारा"],
            "बाजुरा": ["बडिमालिका", "बुढीगंगा", "बुढीनन्दा", "गौमुल", "हिमाली", "जगन्नाथ", "खप्तड छेडेदह", "स्वामीकार्तिक खापर", "त्रिवेणी"],
            "डडेल्धुरा": ["अजयमेरु", "आलिताल", "अमरगढी", "भागेश्वर", "गन्यापधुरा", "नवदुर्गा", "परशुराम"],
            "दार्चुला": ["अपिहिमाल", "ब्यास", "दुहुँ", "लेकम", "महाकाली", "मालिकार्जुन", "मर्मा", "नौगाड", "शैल्यशिखर"],
            "डोटी": ["आदर्श", "बडीकेदार", "दिपायल सिलगढी", "जोरयाल", "के आई सिंह", "पूर्वचौकी", "सायल", "शिखर", "बोगटान फुड्सिल"],
            "कैलाली": ["बर्दगोरिया", "भजनी", "चुरे", "धनगढी", "गौरीगंगा", "घोडाघोडी", "गोदावरी", "जानकी", "जोशीपुर", "कैलारी", "लम्कीचुहा", "मोहन्याल", "टीकापुर"],
            "कञ्चनपुर": ["बेदकोट", "बेलौरी", "बेलडाँडी", "भीमदत्त", "कृष्णपुर", "लालझाडी", "दोधारा चाँदनी", "पुनर्वास", "शुक्लाफाँटा"]
        }
    },

    "coords": {
        "ताप्लेजुङ": [27.35, 87.67], "संखुवासभा": [27.45, 87.21], "सोलुखुम्बु": [27.50, 86.71],
        "ओखलढुङ्गा": [27.31, 86.50], "खोटाङ": [27.20, 86.79], "भोजपुर": [27.17, 87.05],
        "धनकुटा": [26.98, 87.33], "तेह्रथुम": [27.14, 87.55], "पाँचथर": [27.14, 87.85],
        "इलाम": [26.91, 87.92], "झापा": [26.64, 87.99], "मोरङ": [26.64, 87.44],
        "सुनसरी": [26.61, 87.15], "उदयपुर": [26.90, 86.50],
        "सप्तरी": [26.59, 86.75], "सिरहा": [26.65, 86.21], "धनुषा": [26.74, 85.93],
        "महोत्तरी": [26.78, 85.80], "सर्लाही": [26.86, 85.56], "रौतहट": [26.90, 85.32],
        "बारा": [27.01, 85.03], "पर्सा": [27.13, 84.85],
        "दोलखा": [27.67, 86.13], "सिन्धुपाल्चोक": [27.76, 85.73], "रसुवा": [28.14, 85.34],
        "धादिङ": [27.85, 84.92], "नुवाकोट": [27.91, 85.17], "काठमाडौं": [27.71, 85.32],
        "भक्तपुर": [27.67, 85.42], "ललितपुर": [27.60, 85.33], "काभ्रेपलाञ्चोक": [27.53, 85.55],
        "रामेछाप": [27.32, 86.08], "सिन्धुली": [27.26, 85.93], "मकवानपुर": [27.42, 85.03],
        "चितवन": [27.59, 84.44],
        "गोरखा": [28.25, 84.69], "मनाङ": [28.66, 84.15], "मुस्ताङ": [28.81, 83.87],
        "म्याग्दी": [28.48, 83.47], "कास्की": [28.26, 83.97], "लमजुङ": [28.24, 84.37],
        "तनहुँ": [27.96, 84.28], "स्याङ्जा": [28.09, 83.81], "पर्वत": [28.21, 83.68],
        "बागलुङ": [28.27, 83.60], "नवलपरासी (बर्दघाट सुस्ता पूर्व)": [27.78, 84.14],
        "गुल्मी": [28.17, 83.25], "अर्घाखाँची": [27.94, 83.15], "पाल्पा": [27.86, 83.54],
        "नवलपरासी (बर्दघाट सुस्ता पश्चिम)": [27.53, 83.68], "रुपन्देही": [27.65, 83.45],
        "कपिलवस्तु": [27.61, 83.05], "प्युठान": [28.11, 82.88], "रोल्पा": [28.32, 82.65],
        "दाङ": [28.13, 82.31], "बाँके": [28.18, 81.71], "बर्दिया": [28.30, 81.35],
        "रुकुम (पूर्व)": [28.61, 82.93],
        "मुगु": [29.62, 82.16], "हुम्ला": [29.98, 81.82], "डोल्पा": [29.13, 83.18],
        "जुम्ला": [29.27, 82.18], "कालिकोट": [29.14, 81.61], "दैलेख": [28.83, 81.70],
        "जाजरकोट": [28.84, 82.21], "सुर्खेत": [28.59, 81.63], "सल्यान": [28.37, 82.17],
        "रुकुम (पश्चिम)": [28.74, 82.47],
        "बाजुरा": [29.47, 81.35], "बझाङ": [29.75, 81.21], "दार्चुला": [29.85, 80.53],
        "बैतडी": [29.53, 80.51], "डडेल्धुरा": [29.30, 80.58], "डोटी": [29.25, 80.93],
        "अछाम": [29.11, 81.30], "कैलाली": [28.78, 80.85], "कञ्चनपुर": [28.88, 80.25]
    }
};

window.DISTRICT_NAME_MAP = {

    'LAMJUNG': 'लमजुङ',

    'SYANGJA': 'स्याङ्जा',

    'GULMI': 'गुल्मी',

    'SURKHET': 'सुर्खेत',

    'KASKI': 'कास्की',

    'MYAGDI': 'म्याग्दी',

    'GORKHA': 'गोरखा',

    'DHADING': 'धादिङ',

    'PARSA': 'पर्सा',

    'KATHMANDU': 'काठमाडौं',

    'PARBAT': 'पर्वत',

    'BAGLUNG': 'बागलुङ',
     'BAGLUNG': 'बाग्लुङ',

    'NAWALPARASI': 'नवलपरासी (बर्दघाट सुस्ता पश्चिम)',

    'PALPA': 'पाल्पा',

    'RUPANDEHI': 'रुपन्देही',

    'KAPILBASTU': 'कपिलवस्तु',

    'ARGHAKHANCHI': 'अर्घाखाँची',

    'MANANG': 'मनाङ',

    'MUSTANG': 'मुस्ताङ',

    'DHANUSA': 'धनुषा',

    'SINDHUPALCHOK': 'सिन्धुपाल्चोक',

    'ILAM': 'इलाम',

    'JHAPA': 'झापा',

    'TAPLEJUNG': 'ताप्लेजुङ',

    'PANCHTHAR': 'पाँचथर',

    'OKHALDHUNGA': 'ओखलढुंगा',

    'KHOTANG': 'खोटाङ',

    'SOLUKHUMBU': 'सोलुखुम्बु',

    'SUNSARI': 'सुनसरी',

    'TEHRATHUM': 'तेह्रथुम',

    'SANKHUWASABHA': 'संखुवासभा',

    'BHOJPUR': 'भोजपुर',

    'DHANKUTA': 'धनकुटा',

    'MORANG': 'मोरङ',

    'UDAYAPUR': 'उदयपुर',

    'SAPTARI': 'सप्तरी',

    'SIRAHA': 'सिरहा',

    'MAHOTTARI': 'महोत्तरी',

    'SARLAHI': 'सर्लाही',

    'RAUTAHAT': 'रौतहट',

    'BARA': 'बारा',

    'CHITWAN': 'चितवन',

    'CHITAWAN': 'चितवन',

    'MAKWANPUR': 'मकवानपुर',

    'MAKAWANPUR': 'मकवानपुर',

    'BHAKTAPUR': 'भक्तपुर',

    'LALITPUR': 'ललितपुर',

    'NUWAKOT': 'नुवाकोट',

    'RASUWA': 'रसुवा',

    'KAVRE': 'काभ्रेपलाञ्चोक',

    'KAVREPALANCHOWK': 'काभ्रेपलाञ्चोक',

    'SINDHULI': 'सिन्धुली',

    'RAMECHHAP': 'रामेछाप',

    'DOLAKHA': 'दोलखा',

    'DANG': 'दाङ',

    'PYUTHAN': 'प्युठान',

    'ROLPA': 'रोल्पा',

    'DOLPA': 'डोल्पा',

    'MUGU': 'मुगु',

    'ACHHAM': 'अछाम',

    'ACCHAM': 'अछाम',

    'RUKUM': 'रुकुम (पूर्व)',

    'SALYAN': 'सल्यान',

    'JUMLA': 'जुम्ला',

    'HUMLA': 'हुम्ला',

    'KALIKOT': 'कालिकोट',

    'DAILEKH': 'दैलेख',

    'JAJARKOT': 'जाजरकोट',

    'BARDIYA': 'बर्दिया',

    'BANKE': 'बाँके',

    'BAJURA': 'बाजुरा',

    'BAJHANG': 'बझाङ',

    'DADELDHURA': 'डडेल्धुरा',

    'DADHELDHURA': 'डडेल्धुरा',

    'DARCHULA': 'दार्चुला',

    'BAITADI': 'बैतडी',

    'DOTI': 'डोटी',

    'KAILALI': 'कैलाली',

    'KANCHANPUR': 'कञ्चनपुर',

    'TANAHU': 'तनहुँ',

    'DHANUSHA': 'धनुषा',

    'NAWALPUR': 'नवलपरासी (बर्दघाट सुस्ता पूर्व)',

    'PARASI': 'नवलपरासी (बर्दघाट सुस्ता पश्चिम)',

    'EASTERN RUKUM': 'रुकुम (पूर्व)',

    'WESTERN RUKUM': 'रुकुम (पश्चिम)',

    'TERHATHUM': 'तेह्रथुम'

};